let A1 = [
["Шоколадный торт “Бинго”", "Конфеты “Радуга” с разными начинками", "Печенье “Счастье” с орехами и изюмом", "Мармелад “Веселка” в форме животных"],
["Сок “Фруктовый рай” из апельсина, манго и ананаса", "Кофе “Бинг” с ароматом ванили и корицы", "Чай “Зеленый оазис” с мятой и лимоном", "Квас “Дедушкин рецепт” с хлебными сухарями"],
["Йогурт “Био-Бинг” с клубникой и гранолой", "Сыр “Золотой ключик” с травами и специями", "Молоко “Свежее утро” из подворного хозяйства", "Творог “Домашний” с изюмом и ванилью"],
["Колбаса “Вкусная” из свинины и говядины", "Котлеты “Мамин рецепт” с луком и чесноком", "Буженина “Праздничная” с медово-горчичной глазурью", "Сосиски “Дружба” без сои и крахмала"],
["Помидоры “Солнечные” выращенные в теплице", "Огурцы “Хрустящие” с натуральным ароматом", "Бананы “Тропические” спелые и сладкие", "Яблоки “Антоновка” кисло-сладкие и сочные"],
["Батон “Ржаной” с добавлением отрубей", "Булочки “Пушистые” с маком и сахарной пудрой", "Хлеб “Деревенский” из пшеничной муки", "Пирог “Яблочный” с корицей и орехами"]
];

let A2 = [
["Вещь 1", "Вещь 2", "Вещь 3", "Вещь 4"],
["Вещь 5", "Вещь 6", "Вещь 7", "Вещь 8"],
["Вещь 9", "Вещь 10", "Вещь 11", "Вещь 12"],
["Вещь 13", "Вещь 14", "Вещь 15", "Вещь 16"]
];



function CellChanger(cell, cellName) {
    Clear(cellName);

    let arrL = cell.length;
    let text;

    for (let i = 0; i < arrL; i++) {
        let num = i + 1;
        text = "<span>Полка " + num + "</span>";
        Code(text);
        for (let j = 0; j < cell[i].length; j++) {
            text = '<div class="shelf__item">' + cell[i][j] + '</div>';
            Code(text);
        }
    }
}


function Code(text) {
    document.getElementById("cell-info").insertAdjacentHTML('beforeend', text);
}

function Clear(cell) {
    let text = '<div class="block__header" id="cell-header">Сектор ' + cell + '</div><div class="block__text" id="cell-info"></div>';
    document.getElementById("cell-info").remove();
    document.getElementById("cell-header").remove();
    document.getElementById("cell-info__wrapper").insertAdjacentHTML('beforeend', text);
}
